{
    "title": "Capstone Project - Create a Fruit Ninja Game in Scratch",
    "question": "<h4>Background information</h4>Fruit Ninja is a popular video game enjoyed by children and adults alike.<br><img src='https://learn.qubitsedu.com/images/DP_L6_CP1_Image1.png' width='30%' height='70%' /><br> Create your version of the Fruit Ninja game in Scratch.<br><br><h4>Project objective</h4>Design and develop a game on a given theme using the Scratch platform.<br><br><h4>Requirements</h4>In this game, you must include the following:<br>◼ Choose a suitable backdrop, sprites and its costumes to make the Fruit Ninja game. There should be at least three different types of fruits, one enemy sprite and one lightning sprite to cut the fruits.<br>◼ The fruits should have the whole fruit costume and a cut fruit costume.<br>◼ The fruits should roll and move up the stage.<br>◼ The lightning should move along with the mouse pointer. When the fruits are cut, they should change the costume to cut fruits immediately and roll down to the bottom of the stage.<br>◼ For each fruit sprite that is cut, the player should score one point.<br>◼ If the enemy sprite is cut, the player should lose one life. A total of three lives or chances should be allocated to each player in a single game.<br>◼ The score should be displayed after each life.<br>◼ Once all the three lives are over, the game should end. The final score should be the best of the three lives.<br>◼ The backdrop should switch to the Game Over scene when it ends.Computer science professionals break larger projects into smaller milestones to focus on the end goal. In a similar fashion, here are some milestones for you.Achieve each milestone and submit the result to your teacher",
    "duedate": "",
    "submissionfrom": "",
    "grade_duedate": "",
    "grade": 100,
    "submission_type": "scratch",
    "__submission_type_hint": "onlinetext - onlinefile - scratch - codeblock",
    "activity_instruction": "Sum of 2 numbers",
    "submissionstatus": "yes",
    "online_text_limit": "500",
    "additional_files": "",
    "codeblock_mode": "",
    "__codeblock_mode_hint": "automate - manual",
    "language_type": "",
    "__language_type_hint": "python - sql - htmlcss - scratch - javascript - R - pseudocode - java",
    "grade_type": "scale",
    "grading_method": "direct",
    "uid": "CMS06-TP4-CHDRN16",
    "maxfilesubmissions": "",
    "filetypeslist": "",
    "maxfilesubmissions_size": "",
    "testcases": [
        {
            "value": "Case = Test integer sum\ninput = 1 2 3 5\noutput = 11"
        },
        {
            "value": "Case = Test integer sum\ninput = 1\n -2\n 3\n 5\noutput = 7"
        }
    ]
}